app/views/articles/display_article.html.erb

    <td><%=@linked_article.content%></td>
    <td><%@linked_article.comments.each do |x|%>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`article_id` = 1