app/controllers/articles_controller.rb

  def display_article
    p "ASdsadsa"
    @linked_article = Article.find_by_title(params[:query])
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`title` = 'Sports' LIMIT 1