app/controllers/articles_controller.rb

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 0 LIMIT 1
---
  def display_article
    @linked_article = Article.find(params[:query])