app/controllers/home_controller.rb

  def index
    @articles = Article.all
    @tags = Tag.all
---
SELECT `articles`.* FROM `articles`
SELECT `tags`.* FROM `tags`