app/controllers/tags_controller.rb

  def display_article_related_to_tags
    @linked_tag = (Tag.find(params[:query]))
---
SELECT  `tags`.* FROM `tags` WHERE `tags`.`id` = 1 LIMIT 1